{
    "homeBoxes": [
        { "id": 1, "title": "Start here", "icon": "book-open", "items": [
            { "label": "Setting Foundations", "route": "/" },
            { "label": "Planned Campaigns", "route": "/" },
            { "label": "Character Creation", "route": "/rules/character-creation" },
            { "label": "Homebrew", "route": "/" }
            ] 
        },
        { "id": 2, "title": "Primary ancestries", "icon": "users", "items": [
            { "label": "Human", "route": "/rules/ancestries/human" },
            { "label": "Dwarf", "route": "/rules/ancestries/dwarf" },
            { "label": "Elf", "route": "/rules/ancestries/elf" }
            ] 
        },
        { "id": 3, "title": "Secondary ancestries", "icon": "user-plus" }
    ],
    "menu": [
        { "id": 1, "label": "Home", "route": "/" , "icon": "home" },
        { "id": 2, "label": "Foundry VTT", "route": "/foundry" , "icon": "dice-d20" },
        { "id": 3, "label": "Blog", "route": "/blog" , "icon": "newspaper" },
        { "id": 4, "label": "Campaigns", "route": "/campaigns" , "icon": "flag", "subItems": []},
        { "id": 5, "label": "Rules", "route": "/rules" , "icon": "book", "subItems": [
            {
                "label": "Character creation", "route": "/rules/character-creation"
            },
            {
                "label": "Ancestries", "route": "/rules/ancestries"
            },
            {
                "label": "Heritages", "route": "/rules/heritages"
            },
            {
                "label": "Feats", "route": "/rules/feats"
            }
            ]
        },
        { "id": 6, "label": "Setting", "route": "/setting" , "icon": "globe-africa", "subItems": []},
        { "id": 7, "label": "Misc", "route": "/misc" , "icon": "chess-rook", "subItems": []}
    ],
    "feats": [
        { "id": 1, "title": "Adapted Cantrip", "category": "Feat 1", "tags": [ "Common", "Human" ], "prerequisites" : "spellcasting class feature", "text": "Through study of multiple magical traditions, you’ve altered a spell to suit your spellcasting style. Choose one cantrip from a magical tradition other than your own. If you have a spell repertoire or a spellbook, replace one of the cantrips you know or have in your spellbook with the chosen spell. If you prepare spells without a spellbook (if you’re a cleric or druid, for example), one of your cantrips must always be the chosen spell, and you prepare the rest normally. You can cast this cantrip as a spell of your class’s tradition. If you swap or retrain this cantrip later, you can choose its replacement from the same alternate tradition or a different one.", "source": "Pathfinder 2 Core Rulebook" },
        { "id": 2, "title": "Human Determination", "category": "Feat 1", "tags": [ "Common", "Human", "Fortune", "Homebrew" ], "frequency": "once per day", "trigger": "You attempt a skill check, attack roll or saving throw.", "text": "You are steadfast and determined to overcome any obstacle. When attempting a skill check, attack roll or saving throw, you can roll twice and take the better result." },
        { "id": 3, "title": "Inspire Imitation", "category": "Feat 1", "tags": [ "Common", "Human" ], "text": "Your own actions inspire your allies to great achievements. Whenever you critically succeed at a skill check, you automatically qualify to use the Aid reaction when attempting to help an ally using the same skill, even without spending an action to prepare to do so." , "source": "Pathfinder 2 Core Rulebook" }
    ],
    "heritages": [
        { "id": 1, "title": "Dziecię Lasu", "category": "HERITAGE (II)", "tags": [ "Rare", "Individual", "Magical", "Homebrew" ], "hitPoints": "6" , "abilityBoost": "Wisdom or Charisma, Free", "text": "TBD. See the Heritage's page to find its features, feats and details."},
        { "id": 2, "title": "Half-Elf", "category": "HERITAGE (II)", "tags": [ "Rare", "Individual" ], "text": "TBD. See the Heritage's page to find its features, feats and details."}
    ],
    "ancestries": [
        { "id": "human", "name": "Human", "rarity": "Common", "hitPoints": "8", "size": "Medium", "speed": "25 feet", "abilityBoost": "Free", "languages": "You know 2 languages common to your culture or prevalent in your region (usually Common and the language of your ancestry). If your Intelligence modifier is positive, you know additional languages equal to its value. Additional languages should also be common to you.", "traits": [ "Humanoid", "Human" ], "cultures": [ "Valdorczycy" ], "startingAncestryFeats": [ "No Heritage: 6", "With Heritage (0): 6", "With Heritage (I): 5", "With Heritage (II): 4" , "With Heritage (III): 3"], "description": "TBD" },
        { "id": "dwarf", "name": "Dwarf", "hitPoints": "10", "size": "Medium", "speed": "20 feet", "abilityBoost": "Constitution or Intelligence", "traits": [ "Humanoid", "Dwarf" ], "cultures": [ "Ogniste Krasnoludy" ] },
        { "id": "elf", "name": "Elf", "hitPoints": "6", "size": "Medium", "speed": "30 feet", "abilityBoost": "Dexterity or Wisdom", "traits": [ "Humanoid", "Elf" ], "cultures": [ "Dzikie Elfy" ] }
    ],
    "pages": [
        { "id": "character-creation", "name": "Character Creation", "headline": "Character creation in Age of Fallen Empires setting is very similar to the official rules, but, as it often happens to be, the devil is in the details. Below you can find a list of steps necessary to create a character. Most of them work exactly as suggested in the CRB (Core Rulebook) of Second Edition of Pathfinder RPG, so you should refer to them if possible (they start at page 19). Those few steps that differ from the official rules are (I hope) comprehensively explained.", "text": "<div class=\"text-left\"><ol class=\"list-decimal text-primary text-xl px-8\"><li>KONCEPCJA</li></ol><p class=\"mb-4\">Zgodnie z CRB, ale oczywiście też w ramach settingu, jakim jest Sigmaria. Główna różnica między tym, co jest w podręczniku, a Sigmarią to oczywiście rasy oraz rasowa zawartość (zdolności rasowe, atuty, dziedzictwa, kultury).</p><ol class=\"list-decimal text-primary text-xl px-8\"  start=\"2\"><li>POCZĄTKOWE WARTOŚCI CECH</li></ol><p class=\"mb-4\">Zgodnie z CRB.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"3\"><li>RASA</li></ol><p class=\"mb-4\">Mniej więcej zgodnie z CRB. Najważniejsze, to że wybieramy na tym etapie rasę, która ma wpływ na wiele z naszych statystyk (punkty zdrowia, prędkość poruszania się, atrybuty etc.).</p><p class=\"mb-4\">Jeżeli chodzi o premie i kary do cech, to każda rasa (poza człowiekiem) ma do wyboru jedną premię w dowolną cechę oraz jeden wybór pomiędzy dwiema sztandarowymi cechami danej rasy, a także nie posiada narzuconej kary. Rozwiązałem to w ten sposób, żeby żadna kombinacja rasa-klasa nie była mechanicznie gorsza od innych. Znajomy przykład - krasnolud bard w podręcznikowym ujęciu jest gorszym bardem od bardów ras, które nie mają rasowej kary do charyzmy. Jeżeli chodzi o możliwość wzięcia kary, to można wziąć karę w dowolną cechę, do której nie wybrało się premii, aby zwiększyć cechę rasową, która nie zostałą pierwotnie wybrana do premii. Czyli np. tworząc krasnoluda, który ma premię do inteligencji i kondycji, jako premie wybieramy siłę (z dowolnej premii) oraz kondycję. Dalej możemy wziąć dobrowolną karę, np. do zręczności, aby móc otrzymać dodatkową premię do niewybranej cechy rasowej, czyli inteligencji. Krasnolud może więc na start mieć taki układ premii i kar: dowolna premia i premia do kondycji/inteligencji LUB dowolna premia, premia do kondycji, premia do inteligencji i kara do jednej cechy spośród tych, które nie otrzymały premii.</p><p class=\"mb-4\">Jeżeli chodzi o wybór dziedzictwa, to jest on dobrowolny. Z punktu widzenia świata dziedzictwa są bardzo rzadkie i większość przedstawicieli ras po prostu go nie ma. Dziedzictwo zawsze daje dodatkowe zdolności i najczęściej dostęp do dodatkowych atutów, w związku w jakiś sposób musi być zachowany balans pomiędzy postaciami posiadającymi, a nie posiadającymi dziedzictwa. Ja zdecydowałem się na balansowanie tego liczbą posiadanych na start atutów rasowych - im silniejsze dziedzictwo (i w istocie też bazowa rasa), tym mniej dostępnych na start atutów rasowych ma postać. Człowiek, jako rasa pozbawiona zdolności rasowych, ma dostęp do największej ilości rasowych atutów na start (6). Człowiek z dziedzictwem ma ich mniej, zależnie od tego na jakie dziedzictwo się zdecyduje. Podobnie inne rasy - np. krasnolud bez dziedzictwa ma na start 3 atuty rasowe (ponieważ ma równoważnik kolejnych trzech w zdolnościach rasowych), a posiadając dziedzictwo dające mu kolejne zdolności, ma ich naturalnie jeszcze mniej. Informacje na temat tego, ile początkowych atutów rasowych przysługuje przedstawicielowi danej rasy znajdują się w kolumnie informacyjnej po prawej stronie na podstronie rasy.</p><p class=\"mb-4\">Planowany też jest kolejny punkt w tym kroku tworzenia postaci, mianowicie wybór kultury postaci. To najpewniej będzie już przesądzone na etapie tworzenia koncepcji postaci, jednakże ze względu na to, jak mechanicznie będą działać kultury, czuję, że powinno to zostać opisane tutaj. Kultury, które z czasem pojawią się na stronie, to dość dosłownie po prostu społeczeństwo, z jakiego pochodzi postać. Można o tym myśleć tak, że choć i duński wiking i broniący ojczystej angielskiej ziemii wojownik we wczesnym średniowieczu obydwaj byli ludźmi, to jednak odróżniała ich od siebie kultura - różniły ich wierzenia, wychowanie, wartości, a nawet sposób walki. W ten też sposób chcę zdywersyfikować reprezentantów tej samej rasy. Przynależność do kultury będzie dawała dostęp do odmiennych atutów rasowych, unikalnych dla danej kultury. Można o tym myśleć także w ujęciu fantastycznym - klasycznym przykładem będą leśne i wysokie elfy, które żyją w mocno odmienny sposób.</p><p class=\"mb-4\">TL;DR Wybierasz rasę, od której zależy wiele statystyk twojej postaci oraz jej początkowa liczba featów rasowych. Następnie otrzymujesz premię do jednej z dwóch rasowych cech oraz jeszcze jednej, dowolnej. Opcjonalnie możesz wziąć karę do niepremiowanej cechy aby otrzymać premię do drugiej, niewybranej cechy rasowej. Także opcjonalnie twoja postać może też posiadać dziedzictwo, które zapewnia jej dodatkowe zdolności oraz dostęp do nowych atutów, ale także redukuje początkową liczbę posiadanych atutów. W przyszłości postacie będą też mogły wybrać swoją kulturę, która będzie dawać dostęp do dodatkowych atutów rasowych.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"4\"><li>POCHODZENIE</li></ol><p class=\"mb-4\">Zgodnie z CRB, aczkolwiek preferowane jest, aby pochodzenie postaci zawierało się w ramach rasy oraz kultury, z któej pochodzi. Kultury będą posiadały listę popularnych pochodzeń.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"5\"><li>KLASA</li></ol><p class=\"mb-4\">Zgodnie z CRB. Kultury zawierać będą także niezobowiązujące sugestie, obrazujące które klasy postaci są popularne wśród reprezentantów danej kultury.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"6\"><li>WARTOŚCI CECH</li></ol><p class=\"mb-4\">Zgodnie z CRB.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"7\"><li>SZCZEGÓŁY KLASY</li></ol><p class=\"mb-4\">Zgodnie z CRB.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"8\"><li>EKWIPUNEK</li></ol><p class=\"mb-4\">Zgodnie z CRB. Jeżeli postać startuje na wyższym poziomie, niż 1., również obowiązują zasady z CRB, a szczegóły będą pewnie do dogadania. Informacyjnie zasady dotyczące ekwipunku postaci zaczynającej grę na wyższym poziomie znajdują się na stronach 510-511.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"9\"><li>MODYFIKATORY</li></ol><p class=\"mb-4\">Zgodnie z CRB.</p><ol class=\"list-decimal text-primary text-xl px-8\" start=\"10\"><li>OSTATNIE SZCZEGÓŁY</li></ol><p class=\"mb-4\">Zgodnie z CRB.</p></div>"}
    ]
}